src/cf/Catalogs/Процессы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Процессы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.БизнесЦели</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭлементПроцесса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭлементыПроцесса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательскаяИстория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПользовательскиеИстории</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Персона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Персоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВложенныйПроцесс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Процессы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ЭлементыПроцесса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ЭлементыПроцесса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Старт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПользовательскаяИстория</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Условие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВариантУсловия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВложенныйПроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комментарий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ПользовательскиеИстории.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ПользовательскиеИстории</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.БизнесЦели</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Персона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Персоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеобходимыйФункционал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Функциональности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючевоеДействие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючевыеДействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаУчастияВПроекте</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормаУчастияВПроекте</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ценность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Метрики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Метрики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БизнесВес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФиче</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерФичи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КритерииДостижения</Name>
					<Comment>Как понять что цель достигнура</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Критерий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выполнен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/Процессы/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	Если Ложь
		Или ЭлементПроцесса = Перечисления.ЭлементыПроцесса.Старт
		Или ЭлементПроцесса = Перечисления.ЭлементыПроцесса.ВложенныйПроцесс
		Тогда
		
		Представление = Наименование;
		
	ИначеЕсли ЭлементПроцесса = Перечисления.ЭлементыПроцесса.ПользовательскаяИстория Тогда
		Если ДополнительныеСвойства.Свойство("ДанныеПользовательскойИстории") Тогда
			НовыйЭлемент = Справочники.ПользовательскиеИстории.СоздатьЭлемент();
			
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, ДополнительныеСвойства.ДанныеПользовательскойИстории);
			
			НовыйЭлемент.Записать();
			
			ПользовательскаяИстория = НовыйЭлемент.Ссылка;
			
			Представление = "[" + ДополнительныеСвойства.ДанныеПользовательскойИстории.Персона + "] " + ДополнительныеСвойства.ДанныеПользовательскойИстории.КлючевоеДействие;
		КонецЕсли;
	ИначеЕсли ЭлементПроцесса = Перечисления.ЭлементыПроцесса.Условие Тогда
		Если ДополнительныеСвойства.Свойство("ДанныеУсловия") Тогда
			Представление = ДополнительныеСвойства.ДанныеУсловия.Персона;
		КонецЕсли;
	ИначеЕсли ЭлементПроцесса = Перечисления.ЭлементыПроцесса.ВложенныйПроцесс Тогда
		ВызватьИсключение "Не реализовано";
		
		
	КонецЕсли;
	
КонецПроцедуры
